; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
   room_3 - room
   yellow_ball_1 - ball
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)) (not (or (= ?room2 room_3) (and (agentinroom room_3) (not (= ?room1 room_3))))))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (hold_0) (when (or (= ?obj yellow_ball_1) (carrying yellow_ball_1)) (hold_1)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (and (carrying yellow_ball_1) (not (= ?obj yellow_ball_1))) (hold_1)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_2 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   green_door_1 yellow_door_1 red_door_1 purple_door_1 - door
   red_box_1 red_box_2 yellow_box_1 grey_box_1 - box
   blue_ball_1 green_ball_1 blue_ball_2 - ball
 )
 (:init (agentinroom room_4) (objectinroom red_box_1 room_1) (objectinroom grey_box_1 room_2) (objectinroom yellow_box_1 room_2) (objectinroom yellow_ball_1 room_2) (objectinroom blue_ball_1 room_3) (objectinroom red_box_2 room_4) (objectinroom blue_ball_2 room_4) (objectinroom green_ball_1 room_4) (objectcolor red_box_1 redtype) (objectcolor grey_box_1 greytype) (objectcolor yellow_box_1 yellowtype) (objectcolor yellow_ball_1 yellowtype) (objectcolor blue_ball_1 bluetype) (objectcolor red_box_2 redtype) (objectcolor blue_ball_2 bluetype) (objectcolor green_ball_1 greentype) (objectcolor green_door_1 greentype) (objectcolor yellow_door_1 yellowtype) (objectcolor red_door_1 redtype) (objectcolor purple_door_1 purpletype) (emptyhands) (locked green_door_1) (locked yellow_door_1) (locked red_door_1) (locked purple_door_1) (adjacentrooms room_2 room_1 green_door_1) (adjacentrooms room_1 room_2 green_door_1) (adjacentrooms room_3 room_1 yellow_door_1) (adjacentrooms room_1 room_3 yellow_door_1) (adjacentrooms room_4 room_2 red_door_1) (adjacentrooms room_2 room_4 red_door_1) (adjacentrooms room_4 room_3 purple_door_1) (adjacentrooms room_3 room_4 purple_door_1) (visited room_4) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d yellowtype) (adjacentrooms room_3 room_1 ?d) (at_ ?d) (not (locked ?d)))) (hold_0) (hold_1)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor red_door_1 room_4 room_2)
   added: (at_ red_door_1)
   goals met: 0 of 3
2. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 0 of 3
3. (gotoroom room_4 room_2 red_door_1)
   deleted: (agentinroom room_4) (at_ red_door_1)
   added: (agentinroom room_2) (visited room_2)
   goals met: 0 of 3
4. (gotodoor green_door_1 room_2 room_1)
   added: (at_ green_door_1)
   goals met: 0 of 3
5. (toggle green_door_1)
   deleted: (locked green_door_1)
   goals met: 0 of 3
6. (gotoobject yellow_ball_1 room_2)
   deleted: (at_ green_door_1)
   added: (at_ yellow_ball_1)
   goals met: 0 of 3
7. (pick yellow_ball_1 room_2)
   deleted: (at_ yellow_ball_1) (emptyhands) (objectinroom yellow_ball_1 room_2)
   added: (carrying yellow_ball_1) (hold_0) (hold_1)
   goals met: 2 of 3
8. (gotoroom room_2 room_1 green_door_1)
   deleted: (agentinroom room_2)
   added: (agentinroom room_1) (visited room_1)
   goals met: 2 of 3
9. (gotodoor yellow_door_1 room_1 room_3)
   added: (at_ yellow_door_1)
   goals met: 2 of 3
10. (toggle yellow_door_1)
   deleted: (locked yellow_door_1)
   goals met: 3 of 3
